Repository: seanpm2001/mt-training-data
Catalog: ve/ve_pontoon.tmx
Source language: en_us
Languages: ve

source: Most recordings are of people talking in their natural voice. You can accept the occasional non-standard recording that is shouted, whispered, or obviously delivered in a ‘dramatic’ voice. Please reject sung recordings and those using a computer-synthesized voice.
ve: Zwithu zwinzhi zwo rekhodiwaho ndi zwa vhathu vha tshi khou amba nga ipfi ḽavho ḽa vhukuma. Ni nga ṱanganedza zwithu zwi sa itei tshifhinga tshoṱhe kha zwo rekhodiwaho zwine zwa vha u tzhema, u hevhedza, kana u amba nga ipfi ḽa ane a nga u khou ita ‘ḽitambwa’. Ri humbela uri ni songo tendela zwo rekhodiwaho hu tshi khou imbiwa na zwe ha shumiswa maipfi a dzi khomphuyutha.

source: Most speech databases are trained with an overrepresentation of certain demographics which results in a bias towards <articleLink>male and middle class</articleLink>. Accents and dialects that tend to be under-represented in training data sets are typically associated with groups of people who are already marginalised. Many machines also struggle to understand female voices. This is why in our voice database we want variety!
ve: Datasets nnzhi dza u amba dzi re hone dzi gudiswa hu na vhaimeleli vha nnzhi vha vhubvo ho khetheaho zwa ita uri dzi imeleleswe <articleLink>vhanna na vhathu vhuimo ha vhukati</articleLink>. Kuambele na dzi dialect dzi sa imelelwi zwavhuḓi musi hu tshi itwa dzi data set dza u gudisa dzi tshimbidzana na zwigwada zwa vhathu vhane vha si dzhielwe nṱha. Mitshini minzhi i a konḓelwa na u pfesesa maipfi a vhafumakadzi. Ndi ngazwo kha database yashu ri tshi khou ṱoḓa maipfi o fhambananaho!

source: Mozilla Common Voice is an initiative to help teach machines how real people speak.
ve: Mozilla Common Voice ndi nḓila ya u thusa u funza mitshini nga nḓila ine vhathu vhavhukuma vha amba ngayo.

source: Mozilla Common Voice is made possible by a diverse community of activists, linguists, data scientists, academics and software engineers from all over the world. The project is stewarded by the Mozilla Foundation.
ve: Common Voice ya Mozilla i khou itwa u ri i vhe hone nga vhadzulapo vho fhambananaho vha vhaḓisi vha tshanduko, vhaḓivhi vha luambo, data scientists, magudedzi na dziinzhiniara dza dzi software vha bvaho shangoni nga vhuphara. Yeneyi thandela i khou ṱhogomelwa nga Foundation ya Mozilla.

source: Mozilla is dedicated to keeping the web open and accessible for everyone. To do that we need to empower web creators through projects like Common Voice. As voice technologies proliferate beyond niche applications, we believe they must serve all users equally. That means investing in more languages and accommodating diverse accents and demographics when building and testing voice technologies. Common Voice is a public resource available to everyone and Mozilla teams and developers around the world are already using it on our own projects as well.
ve: Mozilla yo ḓiimisela u ita uri web yavho i dzule i hone nahone i tshi swikelelwa nga vhathu vhoṱhe. Uri ri kone u ita zwenezwi ri tea u manḓafhadza vhasiki vha dzi web nga dzi thendela dzi fanaho na Common Voice. Samusi zwishumiswa zwa thekhinoḽodzhi zwi pfaho ipfi zwi tshi khou aluwa zwi tshi ya lune zwa ḓo vha zwihulu vhukuma, ri tenda uri zwi tea u shumela vhathu vhoṱhe nahone nga u lingana. Zwenezwi zwi amba u tikedza nyambo nnzhi na u ṱanganedza kubulele kwa maipfi na vhubvo ho fhambananaho musi hu tshi khou itwa na u lingwa zwishumiswa zwa thekhinolodzhi zwi pfaho ipfi. Common Voice ndi zwithu zwine zwa nga wanwa nga muṅwe na muṅwe nahone vhashumi vha Mozilla na vha bveledzi shangoni ḽoṱhe vho no thoma u i shumisa kha dzithendela dzavho

source: Mozilla’s open source voice recognition engine Deep Speech can be used to build speech recognition applications. Read our <githubLink>Github overview</githubLink> or join the <discourseLink>DeepSpeech Discourse</discourseLink> to learn how to get started.
ve: Tshishumiswa tsha Mozilla tsha u ḓivha ipfi tshine tsha nga shumiswa nga nnyi na nnyi tsha Deep Speech tshi nga shumiswa kha u ita app dzi ḓivhaho ipfi. Vhalani samari yashu <githubLink>Github</githubLink> kana ni dzhenelele kha <discourseLink>DeepSpeech Discourse</discourseLink> uri ni gude nga ha uri ni nga thoma hani.

source: My Sentences
ve: Mitaladzi yanga

source: Name
ve: Dzina

source: Names of your language
ve: Madzina a Luambo lwaṋu

source: Native Language
ve: Luambo lwa Ḓamuni

source: Need some help with accent?
ve: Ni khou ṱoḓa thuso kha kuambele?

source: Need some help with variants?
ve: Ni khou ṱoḓa thuso nga dzinwe dzi varienti?

source: Need to download your data?
ve: Ni khou tea u downḽoda data dzaṋu?

source: New Language Launch
ve: Luambo luswa lwo ḽontshiwa

source: Next
ve: Tevhela

source: Next Goals: { $goal }
ve: Tshipikwa tshi tevhelaho

source: No
ve: Hai

source: [No ‘a’ in the original text]
ve: [A hu na 'a' kha maṅwalwa a u thoma]

source: No gravatar found for your email
ve: A hu ngo waniwa gravatar ya email yaṋu

source: No microphone found.
ve: A hu na makrofounu yo wanalaho.

source: No rejected sentences found!
ve: A hu na mitaladzi yo haniwaho yo wanalaho!

source: Northern Sotho
ve: IsiNdebele (South)

source: No sentences found!
ve: A hu na mitaladzi yo wanalaho!

source: No sentences to review. <addLink>Add more sentences now!</addLink>
ve: A hu na mutaladzi une wa ṱoḓa u ṱoliwa. <addLink>Pangani miṅwe mitaladzi zwino!</addLink>

source: Note: When set to 'Visible', this setting can be changed from the <profileLink>Profile page</profileLink>
ve: Ṱhogomelani hezwi: Musi yo setiwa kha u 'Vhonala', heyi setiṅi i nga shandukisiwa kha <profileLink> siaṱari ḽa Profaiḽi</profileLink>

source: Note: You will still need to select between Speak or Listen to change contribution type.
ve: Ṱhogomelani hezwi: Ni kha ḓi ḓo tea uri ni nange u Amba kana u Thetshelesa uri ni shandule mufuda wa u nikela.

source: No Thanks
ve: Hai Ndo Livhuwa

source: No variant selected
ve: A hu na varianti yo nangiwaho

source: Now that you know a little bit more about Common Voice, why not try it out? Click on the microphone icon to start reading sentences aloud. <br/><br/>If you prefer to review other people's voice contributions, click on the play icon. You’ll help confirm that recordings match the sentences written on screen.
ve: Samusi zwino ni tshi vho ḓivha zwinzhi nyana nga ha Common Voice, ndi ngani ni sa zwi lingedzi? Puṱedzani kha icon ya khudzaipfi u ri ni thome u vhalela nṱha. <br/><br/>Arali ni tshi funa ni nga ṱolisisa maipfi e vhaṅwe vha shela ngao mulenzhe, puṱedza icon ya u tamba. Ni ḓo kona u khwaṱhisedza uri zwo rekhodiwaho zwi tshimbidzana na mitaladzi yo ṅwalwaho kha tshikirini.

source: Now you can donate your voice to help us build an open-source voice database that anyone can use to make innovative apps for devices and the web. Read a sentence to help machines learn how real people speak. Check the work of other contributors to improve the quality. It’s that simple!
ve: Zwino ni nga nikela nga ipfi ḽaṋu u itela uri thusa uri ri vhe na datasete ya nnyi na nnyi ine muṅwe na muṅwe a nga kona u i shumisa uri hu konwe u itiwa dzi app dza zwithu zwiswa zwa thekhinolodzi na dzi web. Vhalani mutaladzi u itela uri ni kone u thusa mutshini uri u gude nḓila ine vhathu vha vhukuma vha amba ngayo. Ṱolani mushumo wa vhaṅwe vhe vha shela mulenzhe uri mushumo u kone u vha wa khwine-khwine. Zwo leluwa!

source: Number of Voices
ve: Tshivhalo tsha maipfi

source: Numbers. There should be no digits in the source text because they can cause problems when read aloud. The way a number is read depends on context and might introduce confusion in the dataset. For example, the number “2409” could be accurately read as both “twenty-four zero nine” and “two thousand four hundred nine”.
ve: Nomboro. Source text a yo ngo tea u vha na dzi nomboro ngauri zwi nga vhanga thaidzo musi dzo vhalelwa nṱha. Nḓila ine nomboro ya vhalwa ngayo zwi ḓitika nga mafhungo a re kha honoyo mutaladzi nahone zwi nga ḓisa nḓaḓo kha dataset. Sa tsumbo, nomboro ya “2409” i nga vhalwa sa “twenty-four zero nine” kana “two thousand four hundred nine” zwoṱhe zwa vha zwi zwone.

source: Off
ve: Tsima

source: Offensive language
ve: Luambo lwa u Semana

source: Offensive speech
ve: Luambo lwa u Nyadza

source: On
ve: Funga

source: Once logged in you can select your languages from the profile section.
ve: Musi no ḽoga kha akhantu yaṋu ni nga nanga nyambo dzaṋu kha tshipiḓa tsha profaiḽi.

source: On desktop devices you can contribute by downloading…
ve: Kha tshishumiswa tsha desktop ni nga shela mulenzhe nga u downḽoda…

source: One sentence per line
ve: Mutaladzi muthihi kha ḽaini nthihis

source: On his head he wore a beret.
ve: Ṱhohoni yawe o ambara muṅadzi.

source: On iOS please continue with Safari to enable recording…
ve: Kha iOS ri humbela uri ni bvele phanḓa ni tshi shumisa Safari u itela uri ni kone u rekhoda…

source: On the other hand, if you think that the reader has probably never come across the word before, and is simply making an incorrect guess at the pronunciation, please reject. If you are unsure, use the skip button.
ve: Kha ḽiṅwe sia, arali ni tshi vhona u nga muvhali ha athu vhuya a ṱangana na iḽo ipfi, nahone ho tou humbulelwa kubulele kwaḽo, ni songo zwi tendela. Arali ni si na vhungoho, shumisani gunubu ya u pfuka.

source: Optionally join on our email list for updates and new information about the project.
ve: Ni nga khetha u vha tshipiḓa tsha vha re kha mutevhe wa email dzashu vhane vha wana apudeiti na mafhungo maswa maswa nga ha yeneyi thandela.

source: Optionally submitted demographic data (e.g. age, gender, language, and accent) will never be made public on your profile, and will not be linked to your account in the dataset. Individual audio clips will be associated with demographic data for the purpose of more accurate analysis - for example, a researcher might want to target a training model to a specific demographic segment.
ve: Data ine ya nga rumelwa ya mafhungo a zwidodombedzwa zwa muthu (sa tsumbo. miṅwaha, mbeu, luambo, na kuambele) a zwi nga itwi uri zwi wanwe nga vhathu vhoṱhe kha profile yaṋu, nahone a zwi nga ṱumanyiwi na akhantu yaṋu kha datasete. Odio iṅwe na iṅwe yo rekhodiwaho i ḓo tshimbidzana na zwidodombedzwa zwa muthu u itela uri dzi kone u ṱolisiswa nga nḓila yo teaho – sa tsumbo, muṱoḓisisi a nga vha a tshi khou ṱoḓa u gudisa tshishumiswa a tshi itela vhathu vha vhubvo ho khetheaho.

source: Other
ve: Zwiṅwe

source: Other Language
ve: Dziṅwe Nyambo

source: Other people validate those voice clips.
ve: Vhaṅwe vho khwaṱhisedza hezwo zwo rekhodiwaho

source: Other voice datasets…
ve: Dataset dza maṅwe maipfi....

source: Other Voice Datasets
ve: Dataset dza maṅwe maipfi

source: Our community manager will reach out to you to offer extra support, and to let you know if there is already a community working on your language
ve: Minidzhere washu wa vhadzulapo u ḓo ni kwama uri a ni tikedze nga ho engedzeaho, nahone u ḓo ni ḓivhadza arali hu na vho no thomaho u shuma nga luambo lwaṋu

source: Our governance is founded on the pillars of:
ve: Zwi ri langaho zwo thewa kha hedzi phuphu:

source: Our source text is made up of original contributor donations as well as dialogue from public domain movie scripts like <italic>It’s a Wonderful Life</italic>. You can view our source sentences in this <githubLink>GitHub folder</githubLink>.
ve: source text yashu yo itwa nga vhasheli mulenzhe vha u to u thoma na nga mafhungo a bvaho kha zwiṱori wa thelevishini zwi fanaho na <italic>It’s a Wonderful Life</italic>. Ni nga vhona mitaladzi yashu ya u thoma kha <githubLink>GitHub folder</githubLink>.

source: Overall Accuracy
ve: Zwoṱhe zwi re zwone nga u angaredza

source: Overall Hr. Total
ve: Nga u angaredza Hr. Thothaḽi

source: Overall project status: see how far we’ve come!
ve: Mbalo-mbalo dza thandela yoṱhe nga u angaredza: vhonani uri ro no khunyeldza zwifhioi!

source: Partners
ve: Vhashumisani

source: Partnerships and networks
ve: Vhushumisani na dzinetiworke

source: Partner with local organizations or individuals
ve: Shumisanani na madzangano a vhuponi haṋu kana muthu nga eṱhe

source: [Part of the text can’t be heard]
ve: [Tshipiḓa tsha mafhungo a tshi pfali]

source: Past recordings download requests
ve: Khumbelo ya u downḽoda zwo rekhodiwaho kale

source: <p>Common Voice is a publicly available voice dataset, powered by the voices of volunteer contributors around the world. People who want to build voice applications can use the dataset to train machine learning models.</p> <p>At present, most voice datasets are owned by companies, which stifles innovation. Voice datasets also underrepresent: non-English speakers, people of colour, disabled people, women and LGBTQIA+ people. This means that voice-enabled technology doesn’t work at all for many languages, and where it does work, it may not perform equally well for everyone. We want to change that by mobilising people everywhere to share their voice.</p>
ve: <p>Common Voice ndi dataset ine ya nga wanwa nga muṅwe na muṅwe, yo itwaho nga vho maḓilonga vha bvaho shangoni ḽoṱhe. Vhathu vha ṱoḓaho u ita app dzi pfaho maipfi vha nga shumisa dataset hei u itela u gudisa mitshini uri i kone u ḓivha zwenezwi.</p> <p>Zwa zwino, maipfi a re kha dzi dataset nnzhi ndi a dzi khamphani, zwine zwa imisisa mvelaphanḓa bvela phanḓa. Maipfi a re kha dzi dataset ha imeleli zwavhuḓi vhane si ambe Luisimane, vhathu vha si vhaisimane, kana vha holefhali, vhafumakadzi na vhathu vha LGBTQIA+. Zwenezwi zwi amba uri zwishumiswa zwine zwa pfa maipfi zwa thekhinolodzhi a zwi shumi nga nyambo nnzhi nahone hune zwa shuma, a zwi shumi zwavhuḓi kha vhathu vhoṱhe. Ri khou ṱoḓa u shandula zwenezwi nga u ita mutingati wa uri vhathu vhoṱhe huṅwe na huṅwe vha ri rekhodele ipfi ḽavho.</p>

source: People come and contribute their voices.
ve: Vhathu vha ḓa vha nikela nga maipfi avho.

source: Personal dashboards keep you up-to-date with individual and community progress.
ve: Dashboard yaṋu i ni sumbedza mvela phanḓa yaṋu na ya vhadzulapo.

source: <playbookLink>Find helpful guidance</playbookLink> on the entire Common Voice journey, from localisation to dataset usage, as well as how to connect with our community.
ve: <playbookLink>Wanani thuso</playbookLink> nga ha u shumisa Common Voice, u bva kha vhupo ha tsini u ya kha kushumisele kwa dataset, na nga ha nḓila ine na nga kwamana ngayo na vhadzulapo vha vhuponi haṋu.

source: <playIcon></playIcon>Last one!
ve: <playIcon></playIcon> Ho sala ya u Fhedza!

source: Play/Stop
ve: Puḽeya/Ima

source: Please add a source.
ve: Ri humbela uri ni pange hune zwa bva hone.

source: Please add sentences.
ve: Ri humbela uri ni pange mitaladzi.

source: Please check the <howToLink>guidelines</howToLink>.
ve: Ri humbela uri ni sedze <howToLink>vhulivhisi</howToLink>.

source: Please confirm that these sentences are public domain.
ve: Ri humbela uri ni khwaṱhisedze uri heyi mitaladzi ndi ya fhethu ha tshitshavha tshoṱhe.

source: Please select a language.
ve: Ri humbela uri ni nange luambo

source: Please select a language to review sentences.
ve: Ri humbela uri ni nange luambo uri ni kone u ṱolisisa mutaladzi.

source: Please try again.
ve: Ri humbela uri ni dovhe hafhu.

source: <pontoonAccountLink>Create an account</pontoonAccountLink> if you don’t have one. Then, choose your language <strong>(‘Team’)</strong> and then choose the project, <pontoonCvLink>Common Voice</pontoonCvLink>. There will be files to translate. Click on one, then it shows words in English and a box to translate them.
ve: <pontoonAccountLink>Itani akhanthu</pontoonAccountLink> arali ni sa athu u vha nayo. Ni kone u khetha luambo <strong>(‘Team’)</strong> nahone ni kone u khetha thandela, <pontoonCvLink>Common Voice</pontoonCvLink>. Hu ḓo vha na dzi faela dzine na ḓo dzi ṱalutshedzela. Puṱedzani iṅwe yadzo, i ḓo kona u ni sumbedza maipfi nga Luisimane na bogisi ḽine na ḓo ṱalutshedzela khaḽo.

source: Press play, listen & tell us: did they accurately speak the sentence below?
ve: Puṱedzani tsha u puḽeya, thetshelesa & ri vhudzeni: Naa vho amba zwi re kha mutaladzi u re afho fhasi?

source: Press { shortcut-play-toggle } to toggle play mode
ve: Puṱedzani { shortcut-play-toggle } bathene ya u puḽeya

source: Privacy
ve: Tshiphiri

source: Privacy Policy
ve: Mulayo wa Tshiphiri

source: Privacy, security and transparency.
ve: Zwa tshiphirini, tshireledzo na u vhonala

source: Pro
ve: Konḓa

source: Profile
ve: Profaiḽi

source: Profile information improves the audio data used in training speech recognition accuracy.
ve: Zwidodombedzwa zwa profaiḽi zwi khwinisa data ya odio ine ya shumiswa u gudisa zwa u ḓivha ipfi nga nḓila kwayo.

source: Profile: { $username }
ve: Profaiḽi: { $username }

source: Progress
ve: Zwe na zwi ita

source: Punctuation. Special symbols and punctuation should only be included when absolutely necessary. For example, an apostrophe is included in English words like “don’t” and “we’re” and should be included in the source text, but it’s unlikely you’ll ever need a special symbol like “@” or “#.”
ve: Zwiga zwa u vhala. Tswayo dzo khetheaho na zwiga zwa u vhala zwi tea u katelwa arali zwi zwa ndeme vhukuma. Sa tsumbo, kha Luisimane tshiḓevhe tshi katelwa kha maipfi angaho “don’t” na “we’re” nahone a tea u katelwa kha source text (luambo lwe zwa ṅwalwa ngalo), fhedzi a zwi nga anzeli u itea uri ni shumise tswayo dzi ngaho “@” or “#.”

source: [‘Raised’ in English is always pronounced as one syllable, not two]
ve: [Ipfi ḽa Luisimane 'Raised' musi ḽi tshi bulwa hu ombedzelwa dungo ḽithihi tshifhinga tshoṱhe, hu si mavhili]

source: Reader Effects
ve: Mvelelo dzine dza itwa nga Vhavhali

source: Reading contractions that aren't actually there, such as "We're" instead of "We are", or vice versa.
ve: U vhala zwithu zwi si hoho, sa tsumbo "we're" nṱhani ha "we are" kana vaisa versa.

source: Read More
ve: Vhalani zwo Engedzeaho

source: Read more on our About page
ve: Vhalani zwinzhi kha siaṱari la Ngaha

source: Read our How-to if unsure how to attribute
ve: Vhalani How-to yashu arali ni si na vhutanzi

source: Read the sentence carefully - don’t miss, change or add words.
ve: Vhalani mutaladzi zwavhuḓi - ni songo pfuka maipfi, u a shandukisa kana u a engedza.

source: { $readyCount } sentences ready for submission!
ve: { $readyCount } mitaladzi yo lugela u rumelwa!

source: Ready to add your voice or lend your ear?
ve: Naa no lugela u panga ipfi ḽaṋu kana u hadzima nḓevhe yaṋu?

source: Ready to contribute?
ve: Naa no lugela u nikela?

source: Ready to do { $count } more?
ve: Naa no lugela u ita { $count } zwinzhi?

source: Ready to donate your voice?
ve: Naa no lugela u nikela nga ipfi ḽaṋu?

source: Ready to help validate sentences?
ve: Naa no lugela u thusa u khwaṱhisedza mitaladzi?

source: reCAPTCHA is required if you want to proceed
ve: reCAPTCHA a khou ṱoḓea arali ni tshi khou ṱoḓa u ya phanḓa

source: Receive emails such as challenge and goal reminders, progress updates, and newsletters about Common Voice.
ve: Wanani milaedza nga email yo nonga khumbudzo ya zwipikwa, mvelaphanḓa, na maswa maswa a Common Voice.

source: Recorded Clips
ve: Zwo Rekhodiwaho

source: Recorded Hours
ve: Awara dzo Rekhodiwaho

source: <recordIcon></recordIcon> Last one!
ve: <recordIcon></recordIcon> Ndi ya u Fhedza!

source: [Recording cut off before the end of the last word]
ve: [Zwo rekhodiwaho zwo khathuwa ipfi ḽa u fhedza ḽi sa athu fhelela]

source: Recordings
ve: Zwo rekhodiwaho

source: Recording voice clips is an integral part of building our open dataset; some would say it's the fun part too.
ve: U rekhoda maipfi ndi tshipiḓa tsha u ita datasete yashu; vhaṅwe vha nga ri na tshenetshi ndi tshipiḓa tshi takadzaho.

source: Record/Stop
ve: Rekhonani/Imani

source: Record your voice
ve: Rekhodani ipfi ḽaṋu

source: Reject
ve: Hanela

source: Rejected Sentences
ve: Mitaladzi yo Haniwaho

source: { $rejectedSentences } rejected sentences.
ve: { $rejectedSentences } ho haniwa mitaladzi.

source: Remember that we need permission to publish those sentences, so always ensure that the text belongs to the <wikipediaLink>public domain</wikipediaLink>. If there is no explicit indication, reach out to the person that the text belongs to and ask if they want to contribute their text to the Public Domain. If they want to, help them go through the <cc0WaiverLink>Contributions Agreement</cc0WaiverLink> process. If they do not want to contribute the text, then you are not allowed to use that text.
ve: Ni humbule uri ri ṱoḓa tendelo uri ri anḓadze yeneyo mitaladzi, ni dzule ni tshi ita vhungoho ha uri zwo ṅwalwaho ndi zwa <wikipediaLink>fhethu ha tshitshavha tshoṱhe</wikipediaLink>. Arali hu songo bvelwa khagala, vhudzisani muṋe wazwo arali a tshi ṱoḓa uri zwe a shela ngazwo mulenzhe zwi anḓadzwe Fhethu ha Tshitshavha Tshoṱhe. Arali vha tshi zwi takalela, vha thuseni uri vha vhale <cc0WaiverLink>Thendelo ya Vhashelaho mulenzhe</cc0WaiverLink>. Arali vha sa ṱoḓi u nikela nga zwo ṅwaliwaho, a no ngo tendelwa u shumisa zwo ṅwaliwaho.

source: remove
ve: Bvisa

source: Remove
ve: Bvisa

source: Remove Avatar
ve: Bvisani Avatar

source: Report
ve: Muvhigo

source: Report Bugs
ve: Vhigani zwi sa Tshimbili zwavhuḓi

source: Report copyright issues
ve: Vhigani thaidzo dza kopi ya vhuṋe

source: Report was passed successfully
ve: Muvhigo wo phasa

source: Request a Language
ve: Itani khumbelo ya Luambo

source: Request recordings
ve: Humbelani zwo rekhodiwaho

source: *required
ve: *Zwi ya todea

source: Re-record
ve: Dovhani ni Rekhode

source: Re-record clip
ve: Dovhani ni rekhode

source: Reset skipped sentences
ve: Risetani mitaladzi yo pfukhiwaho

source: Return
ve: Humelani

source: Return here to edit your goal anytime.
ve: Vhuyelani hafha uri ni kone u shandukisa tshipikwa tshaṋu tshifhinga tshiṅwe na tshiṅwe.

source: Return to Common Voice
ve: Humelani kha Common Voice

source: Return to Common Voice Datasets
ve: Humelani kha dzi Dataset dza Common Voice

source: Return to Languages
ve: Humelani kha dzi Nyambo

source: Review
ve: Ṱolisisa

source: Review could not be saved. Please try again later.
ve: Zwe na ṱolisisa a zwi ngo vhulungea kana u seivea. Ri humbela uri ni lingedze hafhu nga murahu nyana.

source: ⓘ Review Criteria
ve: ⓘ Nḓila ya u Ṱolisisa

source: Review Criteria
ve: Nḓila dza u Ṱolisisa

source: Reviewed sentences not submitted, are sure?
ve: Mitaladzi yo ṱolisiswaho a yo ngo rumelwa, ni na vhuṱanzi?

source: <reviewLink>Review now!</reviewLink>
ve: <reviewLink>Ṱolisisani zwino!</reviewLink>

source: Review & re-record clips here as you go
ve: Ṱolisisani & ni dovholole u rekhoda ni tshi khou bvela phanḓa

source: Review & re-record clips if needed
ve: Ṱolisisani & dovhololani u rekhoda arali zwo fanela

source: Review sentences
ve: Ṱolisisani Mitaladzi

source: Review Sentences
ve: Ṱolisisani Mitaladzi

source: Review & Submit
ve: Ṱolisisani ni rumele

source: Save
ve: Seiva

source: Saved
ve: Seivea

source: Search
ve: Ṱoḓa

source: Search for answers
ve: Ṱoḓani phindulo

source: Search for them on the Internet
ve: Zwi ṱoḓeni kha Inthanethe

source: See how your progress compares to other contributors all over the world.
ve: Vhonani uri mvela phanḓa yaṋu i hani ni tshi i vhambedza na ya vhaṅwe vho nikelaho u mona na shango ḽoṱhe.

source: See Less
ve: Vhonani Zwiṱuku

source: See More
ve: Vhonani Zwo Engedzeaho

source: Select a Language...
ve: Nangani luambo

source: Selected
ve: Nangani

source: Select Language
ve: Nangani luambo

source: Send sign up link
ve: Rumelani ḽinki ya u ḓiṅwalisa

source: Sentence Collection
ve: Kuvhanganya Mitaladzi

source: <sentenceCollectorFragment>See more on sentence collection</sentenceCollectorFragment>.
ve: <sentenceCollectorFragment>Vhonani zwo engedzeaho kha u kuvhanganya mitaladzi </sentenceCollectorFragment>.
